In [2]:
import pandas as pd
import numpy as np

1. Leemos el csv ´listing.csv´ y obesevamos su informacion

In [4]:
df = pd.read_csv('listings.csv')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35172 entries, 0 to 35171
Data columns (total 18 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              35172 non-null  int64
 1   name                            35172 non-null  object
 2   host_id                         35172 non-null  int64
 3   host_name                       35166 non-null  object
 4   neighbourhood_group             0 non-null      float64
 5   neighbourhood                   35172 non-null  object
 6   latitude                        35172 non-null  float64
 7   longitude                       35172 non-null  float64
 8   room_type                       35172 non-null  object
 9   price                           31598 non-null  float64
 10  minimum_nights                  35172 non-null  int64
 11  number_of_reviews               35172 non-null  int64
 12  last_review                     29412 non-null  object
 13  reviews_per_month               29412 non-null  float64
 14  calculated_host_listings_count  35172 non-null  int64
 15  availability_365                35172 non-null  int64
 16  number_of_reviews_ltm           35172 non-null  int64
 17  license                         390 non-null    object
dtypes: float64(5), int64(7), object(6)
memory usage: 4.8+ MB

In [8]:
df.head(5)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,11508,Amazing Luxurious Apt-Palermo Soho,42762,Candela,NaN,Palermo,-34.581840,-58.424150,Entire home/apt,67518.0,3,44,2025-01-26,0.29,1,300,5,NaN
1,14222,"RELAX IN HAPPY HOUSE - PALERMO, BUENOS AIRES",87710233,María,NaN,Palermo,-34.586170,-58.410360,Entire home/apt,22375.0,7,123,2025-01-18,0.80,6,44,8,NaN
2,15074,ROOM WITH RIVER SIGHT,59338,Monica,NaN,Nuñez,-34.538920,-58.465990,Private room,NaN,29,0,NaN,NaN,1,0,0,NaN
3,16695,DUPLEX LOFT 2 - SAN TELMO,64880,Elbio Mariano,NaN,Monserrat,-34.614390,-58.376110,Entire home/apt,52511.0,2,45,2019-11-30,0.27,9,365,0,NaN
4,20062,PENTHOUSE /Terrace & pool /City views /2bedrooms,75891,Sergio,NaN,Palermo,-34.581848,-58.441605,Entire home/apt,113360.0,2,330,2025-01-17,1.84,4,209,25,NaN

Identifico que columnas deseo mantener para el futuro analisis:
1. id
2. neighbourhood
3. latitude
4. longitude
5. roomtype
6. price
7. minimum_nights
8. number of reviews

Identifico subcategorias de la categoria 'neighbourhood' para obtener mas información

In [49]:
df['neighbourhood'].unique()

array(['Palermo', 'Nuñez', 'Monserrat', 'Constitucion', 'San Nicolas',
       'Chacarita', 'Recoleta', 'Belgrano', 'Retiro', 'San Telmo',
       'Boedo', 'Colegiales', 'Almagro', 'Balvanera', 'Puerto Madero',
       'Caballito', 'Parque Chacabuco', 'Villa Crespo', 'Villa Urquiza',
       'Coghlan', 'Parque Patricios', 'San Cristobal', 'Boca',
       'Villa Luro', 'Villa Devoto', 'Flores', 'Monte Castro',
       'Villa Ortuzar', 'Villa Gral. Mitre', 'Barracas', 'Saavedra',
       'Villa Del Parque', 'Floresta', 'Villa Pueyrredon', 'Paternal',
       'Villa Santa Rita', 'Velez Sarsfield', 'Parque Avellaneda',
       'Villa Real', 'Parque Chas', 'Villa Lugano', 'Agronomia',
       'Mataderos', 'Versalles', 'Liniers', 'Nueva Pompeya',
       'Villa Riachuelo', 'Villa Soldati'], dtype=object)

Leo el Segundo csv 'calendar.csv' y aplico lo mismo.

In [54]:
df2= pd.read_csv('calendar.csv')

In [53]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12837777 entries, 0 to 12837776
Data columns (total 7 columns):
 #   Column          Dtype
---  ------          -----
 0   listing_id      int64
 1   date            object
 2   available       object
 3   price           object
 4   adjusted_price  float64
 5   minimum_nights  float64
 6   maximum_nights  float64
dtypes: float64(3), int64(1), object(3)
memory usage: 685.6+ MB

In [56]:
df2.head(10)

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,11508,2025-01-30,f,$60.00,NaN,3.0,1125.0
1,11508,2025-01-31,f,$60.00,NaN,3.0,1125.0
2,11508,2025-02-01,f,$60.00,NaN,3.0,1125.0
3,11508,2025-02-02,f,$60.00,NaN,3.0,1125.0
4,11508,2025-02-03,f,$60.00,NaN,3.0,1125.0
5,11508,2025-02-04,f,$60.00,NaN,3.0,1125.0
6,11508,2025-02-05,f,$60.00,NaN,3.0,1125.0
7,11508,2025-02-06,f,$60.00,NaN,3.0,1125.0
8,11508,2025-02-07,f,$60.00,NaN,3.0,1125.0
9,11508,2025-02-08,f,$60.00,NaN,3.0,1125.0

Identifico Columnas a mantener

1. listing_id
2. date
3. minimun_nigths

Empiezo con la eliminacion

In [63]:
df = df.drop(['name','host_id','host_name','neighbourhood_group','last_review','reviews_per_month','calculated_host_listings_count','availability_365','number_of_reviews_ltm','license'], axis=1)

In [65]:
df.info()  #viualizo

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35172 entries, 0 to 35171
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 35172 non-null  int64
 1   neighbourhood      35172 non-null  object
 2   latitude           35172 non-null  float64
 3   longitude          35172 non-null  float64
 4   room_type          35172 non-null  object
 5   price              31598 non-null  float64
 6   minimum_nights     35172 non-null  int64
 7   number_of_reviews  35172 non-null  int64
dtypes: float64(3), int64(3), object(2)
memory usage: 2.1+ MB

Identifico valores nulos en el df

In [68]:
df.isnull().sum()

id                      0
neighbourhood           0
latitude                0
longitude               0
room_type               0
price                3574
minimum_nights          0
number_of_reviews       0
dtype: int64

In [70]:
df = df.dropna()   #Los elimino

In [72]:
df.isnull().sum()

id                   0
neighbourhood        0
latitude             0
longitude            0
room_type            0
price                0
minimum_nights       0
number_of_reviews    0
dtype: int64

Aplico lo mismo para el df2

In [75]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12837777 entries, 0 to 12837776
Data columns (total 7 columns):
 #   Column          Dtype
---  ------          -----
 0   listing_id      int64
 1   date            object
 2   available       object
 3   price           object
 4   adjusted_price  float64
 5   minimum_nights  float64
 6   maximum_nights  float64
dtypes: float64(3), int64(1), object(3)
memory usage: 685.6+ MB

In [77]:
df2=df2.drop(['available','adjusted_price','maximum_nights'], axis=1)

In [79]:
df2.isnull().sum()

listing_id         0
date               0
price              0
minimum_nights    14
dtype: int64

In [81]:
df2=df2.dropna()

In [83]:
df2.head()

   listing_id        date   price  minimum_nights
0       11508  2025-01-30  $60.00             3.0
1       11508  2025-01-31  $60.00             3.0
2       11508  2025-02-01  $60.00             3.0
3       11508  2025-02-02  $60.00             3.0
4       11508  2025-02-03  $60.00             3.0

Le cambio el nombre a las columnas

In [86]:
df2=df2.set_axis(['listing_id',	'date',	'price2','minimum_nights'], axis=1)

In [88]:
df2.head()

   listing_id        date  price2  minimum_nights
0       11508  2025-01-30  $60.00             3.0
1       11508  2025-01-31  $60.00             3.0
2       11508  2025-02-01  $60.00             3.0
3       11508  2025-02-02  $60.00             3.0
4       11508  2025-02-03  $60.00             3.0

Le cambio el tipo de date de la columna 'date' a formate datetime

In [91]:
df2['date']=pd.to_datetime(df2['date'])

In [92]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12837763 entries, 0 to 12837776
Data columns (total 4 columns):
 #   Column          Dtype
---  ------          -----
 0   listing_id      int64
 1   date            datetime64[ns]
 2   price2          object
 3   minimum_nights  float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 489.7+ MB

Guardo Ambos DataFrame en dos archivos csv ditintos, ya listos para utilizarse en Tableau

In [155]:
df.to_csv('listing_limpio.csv')

In [157]:
df2.to_csv('calendar_limpio.csv')